{
    "link-home": "Domů",
    "welcome": "Vítejte na mých stránkách!",
    "link-cv": "Dovednosti",
    "link-about": "O mně",
    "h1-my-name": "Jmenuji se ...",
    "p-my-name": "Jmenuji se Matěj Grot a pocházím z Jižní Moravy, z vesnice s malebným názvem Hrušky. Je mi 32 let. Vyrůstal jsem v Hruškách a Břeclavi, ale na studia jsem se přestěhoval do Brna, kde žiji doposud. ",
    "h1-it-path": "Digitálním nomádem jsem chtěl být již od mala ...",
    "p-it-path": "Již od útlého věku mě informatika přitahovala a vždy jsem se v budoucnosti viděl jako programátor na cestách, nebo jak se tomu dnes říká, digitální nomád. Ta možnost pracovat na dálku a dělat něco kreativního, jako například tvořit webové stránky, mi připadala velice lákavá a osvobozující. Teď se na to již dívám více pragmaticky a pracovat na dálku není můj hlavní cíl. Nyní mě láká informatika jako taková a jsem otevřený práci v kanceláři. Přesto možnost pracovat na dálku je samozřejmě vždy příjemností.",
    "h1-uni-fails": "... jako hlavou proti zdi",
    "p-uni-fails": "V roce 2013 jsem nastoupil na Masarykovu Univerzitu, Fakultu Informatiky, s vysokým očekáváním jak od sebe, tak od studia. Bohužel, realita byla taková, že jsem na studium nebyl mentálně připravený. Opakovaně jsem byl neúspěšný a důvodem rozhodně nebylo to, že bych na to neměl. Jenomže má lenost, nedostatek organizace a disciplíny, byly nepřekonatelné překážky na cestě k dokončení univerzity. A nejhorší na tom snad bylo to, že jsem si to nedokázal přiznat a opakovaně jsem se na univerzitu vracel, jen abych odešel s další porážkou. Bylo to jako hlavou proti zdi.",
    "h1-work-years": "Hurá do práce",
    "p-work-years": "Již během studia jsem nastoupil na pozici manuálního testera ve firmě Worklio, která v té době vyvíjela celou škálu aplikací, ale nakonec se stabilizovala na trhu robustních HR řešení. V tu chvíli bych nikdy neřekl, že ve firmě strávím dalších devět let.",
    "p-work-years-2": "První roky na QA oddělení (Quality Assurance) byli skvělé. Testování mě bavilo a naučil jsem se, že testování je velice důležitá součást vývoje software a je často přehlížena. Po pár letech jsem ucítil potřebu posunout se někam dál. Nejprve jsem začal pomáhat kolegovi s psaním automatických regresivních testů, pomocí jazyka Java a knihovny Selenium. Následně jsem dostal nabídku přejít do oddělení Product Development. Nabídku jsem přijal a začal jsem s návrhy uživatelského rozhraní a logiky pro programátory.",
    "p-work-years-3": "Zprvu šla práce dobře a cítil jsem, že konečně něco tvořím. Bohužel, následně mi přidělili modul bankovnictví, kterému jsem nerozumněl ani za mák a ve firmě nebyl nikdo, kdo by mi pomohl. Celkově firma začala propouštět poměrně dost schopných lidí a na oddělení nás zůstalo málo. Postupem času se pro mě práce stala velice stresující a nezvládal jsem organizovat náš tým. Rozhodl jsem se z firmy odejít, i přes to že jsem tam našel spoustu skvělých přátel.",
    "h1-re-inkarnace": "Rekvalifikace a nová šance.",
    "p-re-inkarnace": "Situace byla taková, že jsem odešel z práce a čekalo mě rozhodování. Jako první a nejlehčí cestu jsem viděl návrat k testování, ať už k manuálnímu, nebo automatizovanému. Další možnost byla zůstat u product developmentu, ale po posledních zkušenostech jsem neměl chuť se do toho znova pouštět. Třetí možnost a tu sem si vybral, byla zkusit konečně to programování!",
    "p-re-inkarnace-2": "Rozhodnul jsem se absolvovat rekvalifikační kurz. Slyšel jsem že pár známých se tak úspěšně dostalo k programování. Navíc byl kurz hrazen státem a tak jsem neměl co ztratit. A myslím že to byla dobrá volba, neboť brzy jsem si uvědomil jak mě programování vždy bavilo. Navíc jsme se na kurzu věnovali jak front endu, tak back endu. Na univerzitě to byl čistě back end a tady jsem konečně přičichnul k JavaScriptu. Taky jsem si připomněl jaké to je dělat webovky. Samotný kurz pro mne nebyl vůbec obtížný a úspěšně jsem jej absolvoval. ",
    "p-re-inkarnace-3": "Takže co dál? Doufám že to bude zábava a že mě čeká spousta dobrodružství s programováním a s novýma kolegama. Moc se na to těším! V tuhle chvíli nejsem skálopevně rozhodnut co chci dělat, jestli front end, back end, nebo obojí. Jsem otevřen prakticky čemukoliv a vím že prvním krokem je získat alespoň rok praxe na libovolné pozici.",
    "h1-welcome": "Vítejte na mých stránkách!",
    "p-welcome": "Vážený návštěvníku, hlavní úlohou těchto stránek je představit mé portfolio a životopis potenciálním zaměstnavatelům. Nic víc zde ZATÍM nehledej. Níže popisuji obsah jednotlivých stránek.",
    "home-page": "Domů - Stránka, na které se aktuálně nachazíte.",
    "about-page": "O mně - Stručné vyprávění a tom kdo jsem a jaká byla má cesta k tomu stát se informatikem.",
    "skills-page": "Dovednosti - Tabulka s výpisem mých dovedností v oblasti informatiky a obecně pracovního života.",
    "portfolio-page": "Portfolio - Stránka s přehledem projektů, na kterých jsem doposud pracoval.",
    "contact-page": "Kontakt - Zde mě můžete kontaktovat.",
    "skills-proglang": "Programovací Jazyky",
    "skills-languages": "Jazyky",
    "czech": "čeština",
    "english": "angličtina",
    "polish": "polština",
    "russian": "ruština",
    "legend": "legenda",
    "beginner": "začátečník",
    "lower-intermediate": "mírně-pokročilý",
    "intermediate": "pokročilý",
    "experienced": "zkušený",
    "expert": "expert",
    "link-portfolio": "portfolio",    
    "portfolio-card-title": "Webovka YogaWithNaty.com",
    "portfolio-card-text": "Plně funkční web se SpringBootem na back-endu.",
    "portfolio-card-date": "28.8.2025",
    "natkaBlog-h1": "YogaWithNaty.com WEB",    
    "natkaBlog-description-label": "Krátký popis",
    "natkaBlog-description": "Hlavním cílem této webové stránky je představit uživatelům Natku, učitelku jógy. Na domovské stránce si uživatel může přečíst, jaké služby nabízí. Dále může přejít na blog, kde Natka zveřejňuje články o józe. Pro rezervaci služeb ji uživatel může kontaktovat prostřednictvím kontaktního formuláře. Do budoucna je v plánu připravit tabulku s časovými sloty, kde si uživatel pomocí kliknutí zarezervuje hodinu jógy v konkrétním čase.",
    "natkaBlog-features-label": "Hlavní funkce",
    "static-pages": "Statické a informativní stránky.",
    "contact-form": "Kontaktní formulář řízený spring bootem.",
    "blog": "Systém pro dynamické přidávání článků. Obsahuje tyto podstránky:",
    "blog-account-management": "Správa uživatelských účtů - login stránka a registrační stránka.",
    "article-management": "Správa článků - vytváření, editace, mazání, přehled a detail článku.",
    "natkaBlog-technologies-label": "Použité technologie",
    "back-end": "Back-end",
    "java-spring-boot": "Java Spring Boot",
    "mysql": "MariaDB",
    "vps": "VPS server hostovaný na WebSupport.cz s operačním systémem Ubuntu.",
    "front-end": "Front-end",
    "html-css": "HTML CSS",
    "bootstrap": "Bootstrap",
    "contact-h1": "Kontaktujte mně!",
    "contact-notice": "Neváhejte mě kontaktovat skrze libovolnou platformu, email či telefon.",
    "link-contact": "Kontakt"

}