{
    "link-home": "Home",
    "welcome": "Welcome to my web pages!",
    "link-cv": "Skills",
    "link-about": "About",
    "h1-my-name": "My name is ...",
    "p-my-name": "My name is Matěj Grot, and I come from a small village in South Moravia with the lovely name Hrušky, which can be translated as \"pears.\" I am 32 years old. I grew up in the village, but I moved to the city of Brno for my studies, where I still live today.",
    "h1-it-path": "I wanted to be digital nomad since very young age.",
    "p-it-path": "Since a very young age, I wanted to work in IT, and I always imagined myself as a developer on the road—a so-called digital nomad. The possibility of working remotely and traveling at the same time, while doing something creative, attracted me a lot. It gave me a sense of freedom. Nowadays, I see it more pragmatically, and being a digital nomad is no longer my main goal. My main goal is IT itself, and I am open to working from an office. However, the possibility of working remotely is always welcome.",
    "h1-uni-fails": "... like with a head against a wall",
    "p-uni-fails": "I started my studies at Masaryk University, Faculty of Informatics, in 2013 with high expectations of myself and the program. Unfortunately, the reality was that at that time, I was not mentally ready for it. I was failing repeatedly, and the reason was definitely not a lack of capacity or talent. Rather, my laziness and lack of organization and discipline were hurdles I could not overcome. The worst part was that I was unable to accept this fact. I kept failing over and over again—it felt like banging my head against a wall.",
    "h1-work-years": "Let's get to work.",
    "p-work-years": "Already during my studies, I started working as a manual tester at Worklio, a software company that at the time was developing a wide range of applications, but eventually specialized in the HR software market. Back then, I would never have thought I'd stay at the company for nine years.",
    "p-work-years-2": "The first years in the QA (Quality Assurance) department were great. I really enjoyed testing, and I learned that it is an important part of software development, even though it is often overlooked. After a few years, I began to feel the need to move forward. First, I started helping my colleague with automated testing, which meant writing regression tests using Java and the Selenium library. Then I had the opportunity to join the Product Development team, which I did. There, I worked on user interface and logic specifications for developers.",
    "p-work-years-3": "At the beginning, the work went well, and I finally felt that I was creating something. Unfortunately, I was later assigned to a new banking module, an area I had no prior knowledge of. Moreover, there was no one in the company with the expertise to guide me. Around the same time, the company began laying off many experienced employees, leaving only a few of us in the department. Over time, my work became increasingly stressful, and I was unable to properly organize my team. Eventually, I decided to leave the company, even though I had found many precious friends there.",
    "h1-re-inkarnace": "Requalification and new chance.",
    "p-re-inkarnace": "I found myself in a situation where I had left my job, and an important decision was in front of me. The first and easiest option was to go back to testing, either manual or automated. Another possibility was to stay in Product Development, but I declined that option due to my last bad experience. The third possibility—and the one I chose—was to finally try development!",
    "p-re-inkarnace-2": "I decided to take a requalification course. I had heard that a couple of my friends had successfully gotten into programming this way. The course was even funded by the state, so I had nothing to lose. And I think it was a good choice. Very soon, I discovered that I had always enjoyed programming. During the course, we touched on both front-end and back-end. At university, it had been all about back-end, but here I finally got to explore JavaScript. I also rediscovered what it feels like to create web pages. The course itself was quite easy for me, and I passed it successfully.",
    "p-re-inkarnace-3": "So, what’s next? I hope it’s going to be fun and full of new adventures with programming and new colleagues. I’m really looking forward to it! At this moment, I haven’t fully decided whether I want to focus on front-end, back-end, or both. I’m open to practically anything, and I know the first step is to get at least a year of hands-on experience in a company.",
    "h1-welcome": "Welcome to my web page!",
    "p-welcome": "Dear visitor, the main task of this web page is to introduce my portfolio and my CV to potential new employers. At this moment, there is nothing more to find here. Here is the list of pages and what you can find on them.",
    "home-page": "Home - The actual page.",
    "about-page": "About – A brief history of who I am and the path I took toward becoming a developer.",
    "skills-page": "Skills – A page with a table listing my skills in the IT field and in my professional life in general.",
    "portfolio-page": "Portfolio – A page showcasing the projects I have completed so far.",
    "contact-page": "Contact - Here you can contact me.",
    "skills-proglang": "Programming languages",
    "skills-languages": "Languages",
    "czech": "Czech",
    "english": "English",
    "polish": "Polish",
    "russian": "Russian",
    "legend": "Legend",
    "beginner": "Beginner",
    "lower-intermediate": "Lower-intermediate",
    "intermediate": "Intermediate",
    "experienced": "Experienced",
    "expert": "Expert",
    "link-portfolio": "portfolio",    
    "portfolio-card-title": "WebPage YogaWithNaty.com",
    "portfolio-card-text": "Fully operational webpage backed by springBoot.",
    "portfolio-card-date": "8/28/2025",
    "natkaBlog-h1": "YogaWithNaty.com WEB",
    "natkaBlog-description-label": "Brief description",
    "natkaBlog-description": "The main purpose of this website is to introduce Naty, a yoga teacher, to visitors. On the homepage, they can see which services she offers. There is also a blog with her articles about yoga. Users can contact her via the contact form. In the future, the plan is to add the option to book a yoga class by selecting a time slot in a schedule.",
    "natkaBlog-features-label": "Main features",
    "natkaBlog-features": "informative pages, ",
    "static-pages": "Static informative pages.",
    "contact-form": "Page with contact form, driven by Spring boot.",
    "blog": "System for managing blog articles. Consists of these modules:",
    "blog-account-management": "Account management - login page and registration page.",
    "article-management": "Article management - creating, editing, removing articles, overview and detail pages.",
    "natkaBlog-technologies-label": "Technologies used",
    "back-end": "Back-end",
    "java-spring-boot": "Java Spring Boot",
    "mysql": "MariaDB",
    "vps": "VPS server hosted by WebSupport.cz with Ubuntu OS.",
    "front-end": "Front-end",
    "html-css": "HTML CSS",
    "bootstrap": "Bootstrap",
    "contact-h1": "Contact me!",
    "contact-notice": "Please do not hesitate to contact me through any of the platforms listed below.",
    "link-contact": "Contact",
    "sachovnice-h1": "Chess in JS",
    "sachovnice-description-label": "Chess game in JavaScript",
    "sachovnice-description": "Here I present the chess game purely in JavaScript. The purpose is only demonstration of my skills. The player must click moves for both colors.",
    "sachovnice-features-label": "Features",
    "single-page-application": "It is Single-Page-Application",
    "all-chess-logic": "Full implementation of chess logic:",
    "castles": "castles",
    "en-passant": "en-passant",
    "pinned-piece": "pinned-piece",
    "checkmate": "checkmate",
    "status-bar": "status bar",
    "the-game-chess": "The GAME!",
    "portfolioSachy-card-title": "Chess Game in JavaScript",
    "portfolioSachy-card-text": "Chess written purely in JavaScript."

}